backend/src/config/load-test.yaml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 50
      rampTo: 1000
      name: "Viral Social Spike Simulation"
scenarios:
  - name: "Public High-Frequency Redirect Path Click"
    flow:
      - get:
          url: "/hIhbZG"
          followRedirect: false